// 4539. 반올림
// 2021.11.10
// 수학
#include<iostream>

using namespace std;

int main()
{
    int n;
    cin >> n;
    for (int i = 0; i < n; i++)
    {
        int n;
        cin >> n;
        if (n > 10)
        {
            n = (n + 5) / 10 * 10;
        }
        if (n > 100)
        {
            n = (n + 50) / 100 * 100;
        }
        if (n > 1000)
        {
            n = (n + 500) / 1000 * 1000;
        }
        if (n > 10000)
        {
            n = (n + 5000) / 10000 * 10000;
        }
        if (n > 100000)
        {
            n = (n + 50000) / 100000 * 100000;
        }
        if (n > 1000000)
        {
            n = (n + 500000) / 1000000 * 1000000;
        }
        if (n > 10000000)
        {
            n = (n + 5000000) / 10000000 * 10000000;
        }
        cout << n << endl;
    }
    return 0;
}
